<?php

return [
    'general' => [
        'model_label' => 'اطلاعیه',
        'plural_model_label' => 'اطلاعیه‌ها',
    ],

    'form' => [
        'tables' => 'انتخاب جداول برای نظارت',
        'columns' => '  ستون‌ها برای دنبال کردن (اختیاری)',
        'column_values' => 'انتخاب مقادیر ستون‌  (اختیاری)',
        'users' => 'انتخاب کاربران برای اطلاع‌رسانی',
        'notification_type' => 'کانال ',
        'is_active' => 'فعال است',
        'notes' => 'یادداشت‌های اضافی',
        'actions' => 'عملیات',

        'tables_description' => '⚡ یک یا چند منبع را انتخاب کنید. ستون‌ها و مقادیر قابل انتخاب به‌طور خودکار بر اساس انتخاب شما تغییر خواهند کرد.',

        'validation_notes_max' => 'لطفاً یادداشت‌ها را در ۵۰۰ کاراکتر یا کمتر نگه دارید.',

        'helper_notes' => 'از این بخش برای ثبت توضیح کوتاه استفاده کنید، اما آن را کمتر از ۵۰۰ کاراکتر نگه دارید.',
        'helper_actions' => 'مشخص کنید کدام رویدادهای پایگاه‌داده باعث ارسال این اعلان می‌شوند.',
        'helper_columns' => 'ارسال اعلان را محدود به تغییرات در این ستون‌های خاص کنید.',
        'helper_column_values' => 'اعلان را تنها زمانی ارسال کن که مقادیر ستون‌ها به این موارد خاص تغییر کنند.',
        'helper_notification_type' => 'نحوه اطلاع‌رسانی به گیرندگان را انتخاب کنید. گزینه «هر دو» یک اعلان درون‌برنامه‌ای و یک ایمیل ارسال می‌کند.',
    ],

    'channels' => [
        'in_app' => 'درون‌برنامه‌ای 💻',
        'email' => 'ایمیل 📧',
        'all' => 'هر دو 🔔',
        'unknown' => 'نامشخص',
    ],

    'table' => [
        'tables' => 'جداول',
        'columns' => 'ستون‌ها',
        'column_values' => 'مقادیر ستون',
        'users' => 'کاربران',
        'actions' => 'عملیات',
        'notification_type' => 'نوع',
        'is_active' => 'فعال',
        'created_by' => 'ایجاد شده توسط',
        'updated_by' => 'به‌روزرسانی شده توسط',
        'created_at' => 'تاریخ ایجاد',
        'updated_at' => 'تاریخ به‌روزرسانی',
    ],

    'filters' => [
        'actions' => 'عملیات',
        'tables' => 'جداول',
        'notification_type' => 'کانال',
        'is_active' => 'وضعیت فعال',
        'active' => 'فعال',
        'inactive' => 'غیرفعال',
        'creator' => 'ایجادکننده',
        'updater' => 'بروزرسانی کننده',
    ],

    'infolist' => [
        'tables' => 'جدول‌ها',
        'actions' => 'عملیات',
        'columns' => 'ستون‌ها',
        'column_values' => 'مقادیر ستون',
        'users' => 'کاربران',
        'notification_type' => 'کانال',
        'is_active' => 'فعال',
        'notes' => 'یادداشت‌ها',
        'created_by' => 'ایجاد شده توسط',
        'updated_by' => 'به‌روزرسانی شده توسط',
        'created_at' => 'تاریخ ایجاد',
        'updated_at' => 'تاریخ بروزرسانی',
    ],
    'action_types' => [
        'create' => 'ایجاد 🟢',
        'update' => 'بروزرسانی 🟡',
        'delete' => 'حذف 🔴',
    ],
];
